print(12 + 89 - 1)

# '1st program'
print((9 ** 0.5) * 5)

# 2nd program
print(9.99 > 9.98 and 1000 != 1000.1)

# 3rd program
print(2 * 2 + 2)
print(2 * (2 + 2))
print(2 * 2 + 2 == 2 * (2 + 2))

# 4th program
print(str('123.456'))  # Задали тип данных строка 'str'
print(type(float('132.456')))  # Изменили тип на дробное число и проверили тип
print(123.456 * 10)  # Простое умножение чисел, вывели результат
print(int(123.456 * 10))  # результат умножения преобразовали в целое число
print(int(123.456 * 10) % 10)
# использовали остаточное деление действия предыдущей строки на 10.
# Хорошо было бы научиться ссылаться на предыдущуюстроку.